In [72]:
import pymysql
import pandas as pd

connection = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             db='EventVenues')

In [73]:
# execute a SQL query and store the results in a DataFrame
df = pd.read_sql_query('SELECT * FROM EventVenues', connection)

/var/folders/5g/z9zk1g_90mgfm1t10z41t5qr0000gn/T/ipykernel_17863/959081489.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('SELECT * FROM EventVenues', connection)

In [62]:
# display the DataFrame
# print(df.head())
# create cursor
mycursor = connection.cursor()

In [63]:
# # sql = "INSERT INTO EventVenues VALUES ('Nepal', '5','7.7', '25', 'Kathmandu', 'Birthday')"

In [56]:
sql = "INSERT INTO EventVenues(`Hotel name`, `Hotel star rating`, `Customer rating`, `City`, `Event_Type`) VALUES (%s, %s, %s, %s, %s)"
values = ("Mistic Mountain", "5", "8.1", "Kathmandu", "Birthday")
mycursor.execute(sql, values)
connection.commit()

In [57]:
# print number of inserted rows
print(mycursor.rowcount, "row inserted.")

1 row inserted.

In [74]:
df = pd.read_sql_query('SELECT * FROM EventVenues', connection)

/var/folders/5g/z9zk1g_90mgfm1t10z41t5qr0000gn/T/ipykernel_17863/3761018649.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('SELECT * FROM EventVenues', connection)

In [77]:
df

,ID,Hotel name,Hotel star rating,Customer rating,City,Event_Type
0,1,Europe,5,8,Sarajevo,Birthday
1,2,Europe,5,8,Sarajevo,Anniversary
2,3,Hills,5,9,Sarajevo,Birthday
3,4,Hills,5,9,Sarajevo,Birthday
4,5,Boutique,4,9,Sarajevo,Marriage
...,...,...,...,...,...,...
115,116,WUD Hotel,3,9,Ljubljana,Anniversary
116,117,uHotel,4,9,Ljubljana,Seminar
117,118,Allegro Hotel,4,9,Ljubljana,Anniversary
118,119,M Hotel,4,8,Ljubljana,Anniversary
119,120,Austria Trend Hotel,4,9,Ljubljana,Seminar